---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.GetCurrent
source: html/59cd53c3-b8d9-8e29-7c6b-c39cd36d4095.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.GetCurrent Method

Returns the current ConduitSize.

## Syntax (C#)
```csharp
public ConduitSize GetCurrent()
```

## Returns
The current ConduitSize.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.